In [1]:
import pandas as pd
import datetime

# MCI Table

In [2]:
url = "https://raw.githubusercontent.com/ahyds/ETL_project/master/Resources/toronto.csv"
data = pd.read_csv(url)

In [3]:
data.head()

,X,Y,Index_,event_unique_id,occurrencedate,reporteddate,premisetype,ucr_code,ucr_ext,offence,...,occurrencedayofyear,occurrencedayofweek,occurrencehour,MCI,Division,Hood_ID,Neighbourhood,Lat,Long,ObjectId
0,-79.343094,43.668449,214,GO-20141948968,2014-04-24T11:29:00.000Z,2014-04-24T12:46:00.000Z,Commercial,1610,200,Robbery - Mugging,...,114.0,Thursday,11,Robbery,D55,68,North Riverdale (68),43.668449,-79.343094,1
1,-79.507927,43.759285,215,GO-20141950728,2014-04-24T13:00:00.000Z,2014-04-24T15:58:00.000Z,House,2120,200,B&E,...,114.0,Thursday,13,Break and Enter,D31,24,Black Creek (24),43.759285,-79.507927,2
2,-79.501663,43.697552,216,GO-20141956416,2014-04-25T13:20:00.000Z,2014-04-25T13:52:00.000Z,Apartment,1430,100,Assault,...,115.0,Friday,13,Assault,D12,30,Brookhaven-Amesbury (30),43.697552,-79.501663,3
3,-79.571510,43.721703,217,GO-20141956867,2014-04-24T17:00:00.000Z,2014-04-25T10:30:00.000Z,Outside,1430,100,Assault,...,114.0,Thursday,17,Assault,D23,4,Rexdale-Kipling (4),43.721703,-79.571510,4
4,-79.503487,43.663891,218,GO-20141957505,2014-04-25T16:00:00.000Z,2014-04-25T16:15:00.000Z,Apartment,1430,100,Assault,...,115.0,Friday,16,Assault,D11,114,Lambton Baby Point (114),43.663891,-79.503487,5

## Clean MCI DataFrame

In [4]:
data = data[['Index_', 'occurrencedate', 'premisetype', 'offence', 'occurrenceyear', 'occurrencemonth', 'occurrenceday', 'occurrencedayofweek', 'occurrencehour', 'MCI', 'Neighbourhood']]
data.rename(columns={'Index_':'id'}, inplace=True)
data.head()

,id,occurrencedate,premisetype,offence,occurrenceyear,occurrencemonth,occurrenceday,occurrencedayofweek,occurrencehour,MCI,Neighbourhood
0,214,2014-04-24T11:29:00.000Z,Commercial,Robbery - Mugging,2014.0,April,24.0,Thursday,11,Robbery,North Riverdale (68)
1,215,2014-04-24T13:00:00.000Z,House,B&E,2014.0,April,24.0,Thursday,13,Break and Enter,Black Creek (24)
2,216,2014-04-25T13:20:00.000Z,Apartment,Assault,2014.0,April,25.0,Friday,13,Assault,Brookhaven-Amesbury (30)
3,217,2014-04-24T17:00:00.000Z,Outside,Assault,2014.0,April,24.0,Thursday,17,Assault,Rexdale-Kipling (4)
4,218,2014-04-25T16:00:00.000Z,Apartment,Assault,2014.0,April,25.0,Friday,16,Assault,Lambton Baby Point (114)

In [5]:
df2 = data[['id','occurrencedate','offence','MCI']]
df2.head()

    id            occurrencedate            offence              MCI
0  214  2014-04-24T11:29:00.000Z  Robbery - Mugging          Robbery
1  215  2014-04-24T13:00:00.000Z                B&E  Break and Enter
2  216  2014-04-25T13:20:00.000Z            Assault          Assault
3  217  2014-04-24T17:00:00.000Z            Assault          Assault
4  218  2014-04-25T16:00:00.000Z            Assault          Assault

In [6]:
df2['YEAR'] = df2['occurrencedate'].str[:4]
df2['MONTH'] = df2['occurrencedate'].str[5:7]

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [7]:
df2['HOUR'] = df2['occurrencedate'].str[11:13].astype(int)
df2 = df2[['id','MCI','YEAR','MONTH','HOUR']]
df2.head()

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

    id              MCI  YEAR MONTH  HOUR
0  214          Robbery  2014    04    11
1  215  Break and Enter  2014    04    13
2  216          Assault  2014    04    13
3  217          Assault  2014    04    17
4  218          Assault  2014    04    16

In [8]:
df2.loc[(df2['HOUR'] >= 18)|(df2['HOUR'] < 6),'TIME'] = 'NIGHT'
df2.loc[(df2['HOUR'] < 18) |(df2['HOUR'] > 6),'TIME'] = 'DAY'
df2 = df2.rename(columns={"MCI":"TYPE"})
df2.head()

    id             TYPE  YEAR MONTH  HOUR TIME
0  214          Robbery  2014    04    11  DAY
1  215  Break and Enter  2014    04    13  DAY
2  216          Assault  2014    04    13  DAY
3  217          Assault  2014    04    17  DAY
4  218          Assault  2014    04    16  DAY

In [9]:
df_cleaned = df2.drop(columns=['id','HOUR'])
df_cleaned.loc[df_cleaned['TYPE'] == "Theft Over","TYPE"] = "Other Theft"

In [10]:
df_cleaned.head()

              TYPE  YEAR MONTH TIME
0          Robbery  2014    04  DAY
1  Break and Enter  2014    04  DAY
2          Assault  2014    04  DAY
3          Assault  2014    04  DAY
4          Assault  2014    04  DAY

In [11]:
df_cleaned.dtypes

TYPE     object
YEAR     object
MONTH    object
TIME     object
dtype: object

In [12]:
df_cleaned["TYPE"] = df_cleaned["TYPE"].astype(str)
df_cleaned["YEAR"] = df_cleaned["YEAR"].astype(str).astype(int)
df_cleaned["MONTH"] = df_cleaned["MONTH"].astype(str).astype(int)
df_cleaned["TIME"] = df_cleaned["TIME"].astype(str)

In [13]:
df_cleaned.dtypes

TYPE     object
YEAR      int64
MONTH     int64
TIME     object
dtype: object

In [14]:
df_cleaned = df_cleaned.loc[df_cleaned["YEAR"] > 2013]

In [15]:
df_cleaned["TYPE"].value_counts()

Assault            90145
Break and Enter    34825
Auto Theft         18130
Robbery            18085
Other Theft         5315
Name: TYPE, dtype: int64

In [16]:
df_cleaned["YEAR"].value_counts()

2018    35382
2017    34457
2016    32751
2015    32282
2014    31628
Name: YEAR, dtype: int64

In [17]:
df_cleaned["MONTH"].value_counts()

10    14850
7     14625
11    14579
5     14521
8     14471
6     14383
9     14294
12    13510
4     13377
1     13078
3     13039
2     11773
Name: MONTH, dtype: int64

# Homicide Table

In [18]:
url_homicide = 'https://raw.githubusercontent.com/ahyds/ETL_project/master/Resources/tor-Homicide.csv'
df_h = pd.read_csv(url_homicide)
df_h.head()

,X,Y,Index_,Event_Unique_ID,Occurrence_year,Division,Homicide_Type,Occurrence_Date,Hood_ID,Neighbourhood,Lat,Long,ObjectId
0,-79.392853,43.685028,1,111878,2004,D53,Other,2004-01-03T05:00:00.000Z,98,Rosedale-Moore Park (98),43.685028,-79.392853,1
1,-79.234962,43.781536,2,125755,2004,D42,Shooting,2004-01-08T05:00:00.000Z,137,Woburn (137),43.781536,-79.234962,2
2,-79.206894,43.810860,3,136086,2004,D42,Shooting,2004-01-08T05:00:00.000Z,132,Malvern (132),43.810860,-79.206894,3
3,-79.434403,43.670475,4,148623,2004,D13,Shooting,2004-01-25T05:00:00.000Z,93,Dovercourt-Wallace Emerson-Junction (93),43.670475,-79.434403,4
4,-79.203865,43.823543,5,148619,2004,D42,Shooting,2004-01-25T05:00:00.000Z,131,Rouge (131),43.823543,-79.203865,5

## Clean Homicide DataFrame

In [19]:
df_h = df_h[['Index_', 'Occurrence_Date']]
df_h.rename(columns={'Index_':'id'}, inplace=True)
df_h['YEAR'] = df_h['Occurrence_Date'].str[:4]
df_h['MONTH'] = df_h['Occurrence_Date'].str[5:7]
df_h['hour'] = df_h['Occurrence_Date'].str[11:13].astype(int)
df_h.head()

   id           Occurrence_Date  YEAR MONTH  hour
0   1  2004-01-03T05:00:00.000Z  2004    01     5
1   2  2004-01-08T05:00:00.000Z  2004    01     5
2   3  2004-01-08T05:00:00.000Z  2004    01     5
3   4  2004-01-25T05:00:00.000Z  2004    01     5
4   5  2004-01-25T05:00:00.000Z  2004    01     5

In [20]:
df_h['hour'].value_counts()

4    666
5    349
Name: hour, dtype: int64

In [21]:
df_h.loc[ (df_h['hour'] >= 18)  | (df_h['hour'] < 6 )  , "TIME"] = "NIGHT"
df_h.loc[ (df_h['hour'] < 18) &  (df_h['hour'] >=6)  , "TIME"] = 'DAY'
df_h['TYPE'] ='Homicide'
df_h.head()

   id           Occurrence_Date  YEAR MONTH  hour   TIME      TYPE
0   1  2004-01-03T05:00:00.000Z  2004    01     5  NIGHT  Homicide
1   2  2004-01-08T05:00:00.000Z  2004    01     5  NIGHT  Homicide
2   3  2004-01-08T05:00:00.000Z  2004    01     5  NIGHT  Homicide
3   4  2004-01-25T05:00:00.000Z  2004    01     5  NIGHT  Homicide
4   5  2004-01-25T05:00:00.000Z  2004    01     5  NIGHT  Homicide

In [22]:
df_h_cleaned = df_h.drop(columns=["id","Occurrence_Date","hour"])

In [23]:
df_h_cleaned["YEAR"] = df_h_cleaned["YEAR"].astype(str).astype(int)
df_h_cleaned["MONTH"] = df_h_cleaned["MONTH"].astype(str).astype(int)
df_h_cleaned = df_h_cleaned.loc[df_h_cleaned["YEAR"] > 2013]

In [24]:
df_h_cleaned = df_h_cleaned[["TYPE","YEAR","MONTH","TIME"]]
df_h_cleaned = df_h_cleaned.reset_index(drop=True)
df_h_cleaned.head()

       TYPE  YEAR  MONTH   TIME
0  Homicide  2014      1  NIGHT
1  Homicide  2014      1  NIGHT
2  Homicide  2014      1  NIGHT
3  Homicide  2014      2  NIGHT
4  Homicide  2014      2  NIGHT

In [25]:
df_h_cleaned["YEAR"].value_counts()

2018    96
2016    75
2017    65
2015    59
2014    58
Name: YEAR, dtype: int64

In [26]:
df_cleaned["MONTH"].value_counts()

10    14850
7     14625
11    14579
5     14521
8     14471
6     14383
9     14294
12    13510
4     13377
1     13078
3     13039
2     11773
Name: MONTH, dtype: int64

# KSI-Traffic Table

In [27]:
url_ksi = 'https://raw.githubusercontent.com/ahyds/ETL_project/master/Resources/tor-KSI.csv'
df_k = pd.read_csv(url_ksi)

In [28]:
df_k = df_k[['Index_', 'YEAR', 'DATE', 'Hour', 'FATAL_NO']]
df_k.rename(columns={'Index_': 'id'}, inplace=True)
df_k.head()

         id  YEAR                      DATE  Hour  FATAL_NO
0  80771254  2017  2017-06-03T04:00:00.000Z    23         0
1  80783528  2017  2017-09-25T04:00:00.000Z    23         0
2  80783529  2017  2017-09-25T04:00:00.000Z    23         0
3  80790062  2017  2017-12-01T05:00:00.000Z    23         0
4  80790894  2017  2017-12-01T05:00:00.000Z    23        55

## Clean Traffic Dataframe

In [29]:
df_k['MONTH'] = df_k['DATE'].str[5:7]
df_k.loc[ (df_k['Hour'] >= 18)  | (df_k['Hour']<6 )  , "TIME"] = "NIGHT"
df_k.loc[ (df_k['Hour'] < 18) &  (df_k['Hour'] >=6)  , "TIME"] = 'DAY'
df_k['TYPE'] = 'Traffic'
df_k.head()

,id,YEAR,DATE,Hour,FATAL_NO,MONTH,TIME,TYPE
0,80771254,2017,2017-06-03T04:00:00.000Z,23,0,06,NIGHT,Traffic
1,80783528,2017,2017-09-25T04:00:00.000Z,23,0,09,NIGHT,Traffic
2,80783529,2017,2017-09-25T04:00:00.000Z,23,0,09,NIGHT,Traffic
3,80790062,2017,2017-12-01T05:00:00.000Z,23,0,12,NIGHT,Traffic
4,80790894,2017,2017-12-01T05:00:00.000Z,23,55,12,NIGHT,Traffic

In [30]:
df_k.dtypes

id           int64
YEAR         int64
DATE        object
Hour         int64
FATAL_NO     int64
MONTH       object
TIME        object
TYPE        object
dtype: object

In [31]:
df_k = df_k.sort_values(by = "YEAR")
df_k_cleaned = df_k.loc[df_k["YEAR"] > 2013]

In [32]:
df_k_cleaned = df_k_cleaned.reset_index(drop = True)

In [33]:
df_k_cleaned = df_k_cleaned[['TYPE','YEAR', 'MONTH', 'TIME']]
df_k_cleaned["MONTH"] = df_k_cleaned["MONTH"].astype('int')
df_k_cleaned.head()

      TYPE  YEAR  MONTH   TIME
0  Traffic  2014     11    DAY
1  Traffic  2014     10    DAY
2  Traffic  2014     11    DAY
3  Traffic  2014     10    DAY
4  Traffic  2014     12  NIGHT

In [34]:
df_k_cleaned["YEAR"].value_counts()

2016    1011
2017     982
2018     981
2015     929
2014     912
Name: YEAR, dtype: int64

In [35]:
df_k_cleaned["MONTH"].astype('int').value_counts()

8     504
5     478
10    475
9     462
6     453
11    422
7     386
12    353
4     343
3     331
1     330
2     278
Name: MONTH, dtype: int64

# Union All Three Tables

In [36]:
df_hk = pd.concat([df_h_cleaned, df_k_cleaned])

In [37]:
df_h_cleaned["TYPE"].value_counts()

Homicide    353
Name: TYPE, dtype: int64

In [38]:
df_k_cleaned["TYPE"].value_counts()

Traffic    4815
Name: TYPE, dtype: int64

In [39]:
df_hk["TYPE"].value_counts()

Traffic     4815
Homicide     353
Name: TYPE, dtype: int64

In [40]:
df_combined = pd.concat([df_cleaned, df_hk])

In [41]:
df_combined["TYPE"].value_counts()

Assault            90145
Break and Enter    34825
Auto Theft         18130
Robbery            18085
Other Theft         5315
Traffic             4815
Homicide             353
Name: TYPE, dtype: int64

In [42]:
df_combined = df_combined.sort_values(by=["YEAR","MONTH"])
df_combined = df_combined.reset_index(drop = True)

In [43]:
df_combined["YEAR"].value_counts()

2018    36459
2017    35504
2016    33837
2015    33270
2014    32598
Name: YEAR, dtype: int64

In [44]:
df_combined = df_combined.rename(columns = {"TYPE": "type", "YEAR": "year", "MONTH": "month", "TIME": "time"})
df_combined.index += 1
df_combined.head()

              type  year  month time
1          Assault  2014      1  DAY
2          Assault  2014      1  DAY
3  Break and Enter  2014      1  DAY
4          Assault  2014      1  DAY
5          Assault  2014      1  DAY

# Load Table into SQL

In [45]:
from config import pw
from sqlalchemy import create_engine

In [50]:
db_path = f"postgresql://postgres:{pw}@localhost:5432/crime_db"
engine = create_engine(db_path)

In [51]:
engine.table_names()

['vancouver_crime', 'toronto_crime']

In [52]:
df_combined.to_sql(name='toronto_crime', con=engine, if_exists='append', index=True, index_label = "id")

In [53]:
pd.read_sql_query('select * from toronto_crime', con=engine).head()

   id             type  year  month time
0   1          Assault  2014      1  DAY
1   2          Assault  2014      1  DAY
2   3  Break and Enter  2014      1  DAY
3   4          Assault  2014      1  DAY
4   5          Assault  2014      1  DAY

# Analysis

### Yearly Total

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
year_df = df_combined[["year","type"]].groupby("year").count()
year_df = year_df.rename(columns={"type":"crime_counts"})
year_df.head()

In [ ]:
year_df.plot(kind='bar',color='lightblue')

plt.xlabel("Year")
plt.xticks(rotation = 0)
plt.ylabel("Number of Crime")
plt.title("Total Crime of the year")

plt.legend(["Crime Counts"],loc='best')
plt.savefig("Images/toronto_crime_count_yr.jpg",bbox_inches = "tight")
plt.show()

### Monthly Average

In [ ]:
df_combined["month"].value_counts()

In [ ]:
month_df = df_combined[["type","month", "year"]].groupby(["month","year"]).count()
month_df = month_df['type'].groupby(['month']).mean()

month_df = pd.DataFrame(month_df)
month_df = month_df.rename(columns={"type":"Average Crime Counts"})

month_df

In [ ]:
month_df.plot(color = "coral")

plt.xlabel("Month")
plt.ylabel("Average Number of Crime")
plt.title("Average Crime of Each Month")

plt.legend(["Average Crime Counts"], loc="best")
plt.savefig("Images/toronto_crime_avg_month.jpg",bbox_inches = "tight")
plt.show()

### Day vs Night

In [ ]:
day_night_df = df_combined[['type','time']].groupby(['time']).count()
day_night_df = day_night_df.rename(columns={"type":"count"})
day_night_df

In [ ]:
day_night_df.plot.pie(y ="count", autopct="%1.1f%%", shadow=True, startangle=140)

plt.axis("equal")

plt.savefig("Images/toronto_day_night.png")
plt.show()

### By Crime Type

In [ ]:
type_df = df_combined['type'].value_counts()
type_df = pd.DataFrame(type_df)
type_df = type_df.rename(columns={"type":"count"})
type_df

In [ ]:
type_df.plot.pie(y ="count", autopct="%1.1f%%", shadow=True, startangle=140)

plt.axis("equal")
plt.legend(loc="best", bbox_to_anchor=(1.5,1))
plt.savefig("Images/toronto_type_count.png")
plt.show()